felias-fogg/TinyCore/avr/boards.txt
##########################################################################################
## This file is created by MCUdude for use with TinyCore                                ##
## https://github.com/MCUdude/TinyCore                                                  ##
##                                                                                      ##
## This is the file where fuse settings, clock frequencies, upload ports, bootloaders,  ##
## debug options andcompiler flags are located.                                         ##
##                                                                                      ##
##########################################################################################


# Menu options
menu.clock=Clock
menu.bod=BOD
menu.eeprom=EEPROM
menu.chip=Chip
menu.bootloader=Bootloader
menu.baudrate=Baud rate
menu.wiremode=Wire mode
menu.resetpin=Reset pin
menu.serial=Serial
menu.pinout=Pinout


########################
#### ATtiny25/45/85 ####
########################

# General
x5.name=ATtiny25/45/85
x5.upload.tool=avrdude
x5.upload.speed={bootloader.baudrate}
x5.bootloader.tool=avrdude
x5.bootloader.unlock_bits=0xff
x5.bootloader.lock_bits=0xff
x5.bootloader.high_fuses=0b1101{bootloader.eesave_bit}{bootloader.bod_bits}
x5.bootloader.pins=swio_rxb1_txb0
x5.build.core=TinyCore
x5.build.variant=tinyx5
x5.build.board=AVR_ATTINYX5
x5.build.extra_flags={build.serialrxtx}

# EEPROM
x5.menu.eeprom.keep=EEPROM retained
x5.menu.eeprom.keep.bootloader.eesave_bit=0
x5.menu.eeprom.erase=EEPROM not retained
x5.menu.eeprom.erase.bootloader.eesave_bit=1

# Chip variants
x5.menu.chip.85=ATtiny85
x5.menu.chip.85.build.mcu=attiny85
x5.menu.chip.85.upload.maximum_size=8192
x5.menu.chip.85.upload.maximum_data_size=512

x5.menu.chip.45=ATtiny45
x5.menu.chip.45.build.mcu=attiny45
x5.menu.chip.45.upload.maximum_size=4096
x5.menu.chip.45.upload.maximum_data_size=256

x5.menu.chip.25=ATtiny25
x5.menu.chip.25.build.mcu=attiny25
x5.menu.chip.25.upload.maximum_size=2048
x5.menu.chip.25.upload.maximum_data_size=128

# Software serial
x5.menu.serial.rxtx=RX and TX
x5.menu.serial.rxtx.build.serialrxtx=
x5.menu.serial.tx=TX only
x5.menu.serial.tx.build.serialrxtx=-DTX_ONLY

# Brown out detection
x5.menu.bod.2v7=BOD 2.7V
x5.menu.bod.2v7.bootloader.bod_bits=101
x5.menu.bod.4v3=BOD 4.3V
x5.menu.bod.4v3.bootloader.bod_bits=100
x5.menu.bod.1v8=BOD 1.8V
x5.menu.bod.1v8.bootloader.bod_bits=110
x5.menu.bod.disable=BOD disabled
x5.menu.bod.disable.bootloader.bod_bits=111

# Clock frequencies
x5.menu.clock.8MHz_internal=8 MHz internal osc.
x5.menu.clock.8MHz_internal.bootloader.clock=8MHz
x5.menu.clock.8MHz_internal.bootloader.osc=i
x5.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
x5.menu.clock.8MHz_internal.bootloader.baudrate=38400
x5.menu.clock.8MHz_internal.build.clocksource=0
x5.menu.clock.8MHz_internal.build.f_cpu=8000000L

x5.menu.clock.16MHz_internal_PLL=16 MHz internal PLL osc.
x5.menu.clock.16MHz_internal_PLL.bootloader.clock=16MHz
x5.menu.clock.16MHz_internal_PLL.bootloader.osc=i
x5.menu.clock.16MHz_internal_PLL.bootloader.low_fuses=0xf1
x5.menu.clock.16MHz_internal_PLL.bootloader.baudrate=115200
x5.menu.clock.16MHz_internal_PLL.build.clocksource=6
x5.menu.clock.16MHz_internal_PLL.build.f_cpu=16000000L

x5.menu.clock.4MHz_internal=4 MHz internal osc.
x5.menu.clock.4MHz_internal.bootloader.clock=4MHz
x5.menu.clock.4MHz_internal.bootloader.osc=i
x5.menu.clock.4MHz_internal.bootloader.low_fuses=0x62
x5.menu.clock.4MHz_internal.bootloader.baudrate=9600
x5.menu.clock.4MHz_internal.build.clocksource=0
x5.menu.clock.4MHz_internal.build.f_cpu=4000000L

x5.menu.clock.1MHz_internal=1 MHz internal osc.
x5.menu.clock.1MHz_internal.bootloader.clock=1MHz
x5.menu.clock.1MHz_internal.bootloader.osc=i
x5.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
x5.menu.clock.1MHz_internal.bootloader.baudrate=9600
x5.menu.clock.1MHz_internal.build.clocksource=0
x5.menu.clock.1MHz_internal.build.f_cpu=1000000L

x5.menu.clock.128kHz_internal=128 kHz internal osc.
x5.menu.clock.128kHz_internal.bootloader.clock=128kHz
x5.menu.clock.128kHz_internal.bootloader.osc=i
x5.menu.clock.128kHz_internal.bootloader.low_fuses=0xe4
x5.menu.clock.128kHz_internal.bootloader.baudrate=1200
x5.menu.clock.128kHz_internal.build.clocksource=3
x5.menu.clock.128kHz_internal.build.f_cpu=128000L

x5.menu.clock.20MHz_external=20 MHz external osc.
x5.menu.clock.20MHz_external.bootloader.clock=20MHz
x5.menu.clock.20MHz_external.bootloader.osc=x
x5.menu.clock.20MHz_external.bootloader.low_fuses=0xff
x5.menu.clock.20MHz_external.bootloader.baudrate=115200
x5.menu.clock.20MHz_external.build.clocksource=1
x5.menu.clock.20MHz_external.build.f_cpu=20000000L

x5.menu.clock.18_432MHz_external=18.432 MHz external osc.
x5.menu.clock.18_432MHz_external.bootloader.clock=18.432MHz
x5.menu.clock.18_432MHz_external.bootloader.osc=x
x5.menu.clock.18_432MHz_external.bootloader.low_fuses=0xff
x5.menu.clock.18_432MHz_external.bootloader.baudrate=115200
x5.menu.clock.18_432MHz_external.build.clocksource=1
x5.menu.clock.18_432MHz_external.build.f_cpu=18432000L

x5.menu.clock.16MHz_external=16 MHz external osc.
x5.menu.clock.16MHz_external.bootloader.clock=16MHz
x5.menu.clock.16MHz_external.bootloader.osc=x
x5.menu.clock.16MHz_external.bootloader.low_fuses=0xff
x5.menu.clock.16MHz_external.bootloader.baudrate=115200
x5.menu.clock.16MHz_external.build.clocksource=1
x5.menu.clock.16MHz_external.build.f_cpu=16000000L

x5.menu.clock.14_7456MHz_external=14.7456 MHz external osc.
x5.menu.clock.14_7456MHz_external.bootloader.clock=14.7456MHz
x5.menu.clock.14_7456MHz_external.bootloader.osc=x
x5.menu.clock.14_7456MHz_external.bootloader.low_fuses=0xff
x5.menu.clock.14_7456MHz_external.bootloader.baudrate=115200
x5.menu.clock.14_7456MHz_external.build.clocksource=1
x5.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

x5.menu.clock.12MHz_external=12 MHz external osc.
x5.menu.clock.12MHz_external.bootloader.clock=12MHz
x5.menu.clock.12MHz_external.bootloader.osc=x
x5.menu.clock.12MHz_external.bootloader.low_fuses=0xff
x5.menu.clock.12MHz_external.bootloader.baudrate=115200
x5.menu.clock.12MHz_external.build.clocksource=1
x5.menu.clock.12MHz_external.build.f_cpu=12000000L

x5.menu.clock.11_0592MHz_external=11.7456 MHz external osc.
x5.menu.clock.11_0592MHz_external.bootloader.clock=11.0592MHz
x5.menu.clock.11_0592MHz_external.bootloader.osc=x
x5.menu.clock.11_0592MHz_external.bootloader.low_fuses=0xff
x5.menu.clock.11_0592MHz_external.bootloader.baudrate=115200
x5.menu.clock.11_0592MHz_external.build.clocksource=1
x5.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

x5.menu.clock.9_216MHz_external=9.216 MHz external osc.
x5.menu.clock.9_216MHz_external.bootloader.clock=9.216MHz
x5.menu.clock.9_216MHz_external.bootloader.osc=x
x5.menu.clock.9_216MHz_external.bootloader.low_fuses=0xff
x5.menu.clock.9_216MHz_external.bootloader.baudrate=115200
x5.menu.clock.9_216MHz_external.build.clocksource=1
x5.menu.clock.9_216MHz_external.build.f_cpu=9216000L

x5.menu.clock.8MHz_external=8 MHz external osc.
x5.menu.clock.8MHz_external.bootloader.clock=8MHz
x5.menu.clock.8MHz_external.bootloader.osc=x
x5.menu.clock.8MHz_external.bootloader.low_fuses=0xff
x5.menu.clock.8MHz_external.bootloader.baudrate=38400
x5.menu.clock.8MHz_external.build.clocksource=1
x5.menu.clock.8MHz_external.build.f_cpu=8000000L

x5.menu.clock.7_3728MHz_external=7.3728 MHz external osc.
x5.menu.clock.7_3728MHz_external.bootloader.clock=7.3728MHz
x5.menu.clock.7_3728MHz_external.bootloader.osc=x
x5.menu.clock.7_3728MHz_external.bootloader.low_fuses=0xfd
x5.menu.clock.7_3728MHz_external.bootloader.baudrate=115200
x5.menu.clock.7_3728MHz_external.build.clocksource=1
x5.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

