felias-fogg/TinyCore/avr/boards.txt
x5.menu.clock.6MHz_external=6 MHz external osc.
x5.menu.clock.6MHz_external.bootloader.clock=6MHz
x5.menu.clock.6MHz_external.bootloader.osc=x
x5.menu.clock.6MHz_external.bootloader.low_fuses=0xfd
x5.menu.clock.6MHz_external.bootloader.baudrate=57600
x5.menu.clock.6MHz_external.build.clocksource=1
x5.menu.clock.6MHz_external.build.f_cpu=6000000L

x5.menu.clock.4MHz_external=4 MHz external osc.
x5.menu.clock.4MHz_external.bootloader.clock=4MHz
x5.menu.clock.4MHz_external.bootloader.osc=x
x5.menu.clock.4MHz_external.bootloader.low_fuses=0xfd
x5.menu.clock.4MHz_external.bootloader.baudrate=38400
x5.menu.clock.4MHz_external.build.clocksource=1
x5.menu.clock.4MHz_external.build.f_cpu=4000000L

x5.menu.clock.3_6864MHz_external=3.6864 MHz external osc.
x5.menu.clock.3_6864MHz_external.bootloader.clock=3.6864MHz
x5.menu.clock.3_6864MHz_external.bootloader.osc=x
x5.menu.clock.3_6864MHz_external.bootloader.low_fuses=0xfd
x5.menu.clock.3_6864MHz_external.bootloader.baudrate=115200
x5.menu.clock.3_6864MHz_external.build.clocksource=1
x5.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

x5.menu.clock.1MHz_external=1 MHz external osc.
x5.menu.clock.1MHz_external.bootloader.clock=1MHz
x5.menu.clock.1MHz_external.bootloader.osc=x
x5.menu.clock.1MHz_external.bootloader.low_fuses=0xfd
x5.menu.clock.1MHz_external.bootloader.baudrate=9600
x5.menu.clock.1MHz_external.build.clocksource=1
x5.menu.clock.1MHz_external.build.f_cpu=1000000L

# Upload port select / Bootloader
x5.menu.bootloader.no_bootloader=No bootloader
x5.menu.bootloader.no_bootloader.build.export_merged_output=false
x5.menu.bootloader.no_bootloader.bootloader.str=
x5.menu.bootloader.no_bootloader.bootloader.extended_fuses=0xff

x5.menu.bootloader.urboot=Urboot
x5.menu.bootloader.urboot.upload.protocol=urclock -D -xnometadata
x5.menu.bootloader.urboot.build.export_merged_output=true
x5.menu.bootloader.urboot.bootloader.str=-Uurboot:1s_pr_noled_{bootloader.pins}_{bootloader.baudrate}baud_{bootloader.osc}{bootloader.clock}
x5.menu.bootloader.urboot.bootloader.extended_fuses=0xfe

x5.menu.bootloader.urboot_-125=Urboot (F_CPU -1.25%)
x5.menu.bootloader.urboot_-125.upload.protocol=urclock -D -xnometadata
x5.menu.bootloader.urboot_-125.build.export_merged_output=true
x5.menu.bootloader.urboot_-125.bootloader.str=-Uurboot:1s_pr_noled_{bootloader.pins}_{bootloader.baudrate}baud_h{bootloader.clock}
x5.menu.bootloader.urboot_-125.bootloader.extended_fuses=0xfe

x5.menu.bootloader.urboot_-250=Urboot (F_CPU -2.50%)
x5.menu.bootloader.urboot_-250.upload.protocol=urclock -D -xnometadata
x5.menu.bootloader.urboot_-250.build.export_merged_output=true
x5.menu.bootloader.urboot_-250.bootloader.str=-Uurboot:1s_pr_noled_{bootloader.pins}_{bootloader.baudrate}baud_g{bootloader.clock}
x5.menu.bootloader.urboot_-250.bootloader.extended_fuses=0xfe

x5.menu.bootloader.urboot_-375=Urboot (F_CPU -3.75%)
x5.menu.bootloader.urboot_-375.upload.protocol=urclock -D -xnometadata
x5.menu.bootloader.urboot_-375.build.export_merged_output=true
x5.menu.bootloader.urboot_-375.bootloader.str=-Uurboot:1s_pr_noled_{bootloader.pins}_{bootloader.baudrate}baud_f{bootloader.clock}
x5.menu.bootloader.urboot_-375.bootloader.extended_fuses=0xfe

x5.menu.bootloader.urboot_-500=Urboot (F_CPU -5.00%)
x5.menu.bootloader.urboot_-500.upload.protocol=urclock -D -xnometadata
x5.menu.bootloader.urboot_-500.build.export_merged_output=true
x5.menu.bootloader.urboot_-500.bootloader.str=-Uurboot:1s_pr_noled_{bootloader.pins}_{bootloader.baudrate}baud_e{bootloader.clock}
x5.menu.bootloader.urboot_-500.bootloader.extended_fuses=0xfe

x5.menu.bootloader.urboot_+125=Urboot (F_CPU +1.25%)
x5.menu.bootloader.urboot_+125.upload.protocol=urclock -D -xnometadata
x5.menu.bootloader.urboot_+125.build.export_merged_output=true
x5.menu.bootloader.urboot_+125.bootloader.str=-Uurboot:1s_pr_noled_{bootloader.pins}_{bootloader.baudrate}baud_j{bootloader.clock}
x5.menu.bootloader.urboot_+125.bootloader.extended_fuses=0xfe

x5.menu.bootloader.urboot_+250=Urboot (F_CPU +2.50%)
x5.menu.bootloader.urboot_+250.upload.protocol=urclock -D -xnometadata
x5.menu.bootloader.urboot_+250.build.export_merged_output=true
x5.menu.bootloader.urboot_+250.bootloader.str=-Uurboot:1s_pr_noled_{bootloader.pins}_{bootloader.baudrate}baud_k{bootloader.clock}
x5.menu.bootloader.urboot_+250.bootloader.extended_fuses=0xfe

x5.menu.bootloader.urboot_+375=Urboot (F_CPU +3.75%)
x5.menu.bootloader.urboot_+375.upload.protocol=urclock -D -xnometadata
x5.menu.bootloader.urboot_+375.build.export_merged_output=true
x5.menu.bootloader.urboot_+375.bootloader.str=-Uurboot:1s_pr_noled_{bootloader.pins}_{bootloader.baudrate}baud_l{bootloader.clock}
x5.menu.bootloader.urboot_+375.bootloader.extended_fuses=0xfe

x5.menu.bootloader.urboot_+500=Urboot (F_CPU +5.00%)
x5.menu.bootloader.urboot_+500.upload.protocol=urclock -D -xnometadata
x5.menu.bootloader.urboot_+500.build.export_merged_output=true
x5.menu.bootloader.urboot_+500.bootloader.str=-Uurboot:1s_pr_noled_{bootloader.pins}_{bootloader.baudrate}baud_m{bootloader.clock}
x5.menu.bootloader.urboot_+500.bootloader.extended_fuses=0xfe

x5.menu.bootloader.micronucleus_original=Original Micronucleus (16 MHz PLL)
x5.menu.bootloader.micronucleus_original.upload.tool=avrdude_micronucleus
x5.menu.bootloader.micronucleus_original.upload.protocol=micronucleus -V -xwait=60
x5.menu.bootloader.micronucleus_original.build.export_merged_output=true
x5.menu.bootloader.micronucleus_original.bootloader.str=-Uflash,lfuse,efuse:w:{runtime.platform.path}/bootloaders/micronucleus/original_{build.mcu}_micronucleus_16MHz.hex:I
x5.menu.bootloader.micronucleus_original.bootloader.extended_fuses=0xfe
x5.menu.bootloader.micronucleus_original.build.clocksource=6
x5.menu.bootloader.micronucleus_original.build.f_cpu=16000000L

x5.menu.bootloader.micronucleus=New Micronucleus (16 MHz PLL)
x5.menu.bootloader.micronucleus.upload.tool=avrdude_micronucleus
x5.menu.bootloader.micronucleus.upload.protocol=micronucleus -V -xwait=60
x5.menu.bootloader.micronucleus.build.export_merged_output=true
x5.menu.bootloader.micronucleus.bootloader.str=-Uflash,lfuse,efuse:w:{runtime.platform.path}/bootloaders/micronucleus/{build.mcu}_micronucleus_16MHz.hex:I
x5.menu.bootloader.micronucleus.bootloader.extended_fuses=0xfe
x5.menu.bootloader.micronucleus.build.clocksource=6
x5.menu.bootloader.micronucleus.build.f_cpu=16000000L

x5.menu.bootloader.micronucleus_upgrade=Upgrade to newest Micronucleus (16 MHz PLL)
x5.menu.bootloader.micronucleus_upgrade.upload.tool=avrdude_micronucleus
x5.menu.bootloader.micronucleus_upgrade.upload.protocol=micronucleus -V -xwait=60
x5.menu.bootloader.micronucleus_upgrade.bootloader.tool=avrdude_micronucleus
x5.menu.bootloader.micronucleus_upgrade.bootloader.protocol={upload.protocol}
x5.menu.bootloader.micronucleus_upgrade.build.export_merged_output=true
x5.menu.bootloader.micronucleus_upgrade.bootloader.str=-Uflash:w:{runtime.platform.path}/bootloaders/micronucleus/upgrade_{build.mcu}_micronucleus_16MHz.hex:i
x5.menu.bootloader.micronucleus_upgrade.upload.str=-Uflash:w:{runtime.platform.path}/bootloaders/micronucleus/upgrade_{build.mcu}_micronucleus_16MHz.hex:i
x5.menu.bootloader.micronucleus_upgrade.build.clocksource=6
x5.menu.bootloader.micronucleus_upgrade.build.f_cpu=16000000L

########################
#### ATtiny24/44/84 ####
########################

# General
x4.name=ATtiny24/44/84
x4.upload.tool=avrdude
x4.upload.speed={bootloader.baudrate}
x4.bootloader.tool=avrdude
x4.bootloader.unlock_bits=0xff
x4.bootloader.lock_bits=0xff
x4.bootloader.high_fuses=0b1101{bootloader.eesave_bit}{bootloader.bod_bits}
x4.bootloader.pins=swio_rxa2_txa1
x4.build.core=TinyCore
x4.build.variant=tinyx4_cw
x4.build.board=AVR_ATTINYX4
x4.build.extra_flags={build.serialrxtx}

