felias-fogg/TinyCore/avr/boards.txt
# Upload port select / Bootloader
x4.menu.bootloader.no_bootloader=No bootloader
x4.menu.bootloader.no_bootloader.build.export_merged_output=false
x4.menu.bootloader.no_bootloader.bootloader.str=
x4.menu.bootloader.no_bootloader.bootloader.extended_fuses=0xff

x4.menu.bootloader.urboot=Urboot (F_CPU)
x4.menu.bootloader.urboot.upload.protocol=urclock -D -xnometadata
x4.menu.bootloader.urboot.build.export_merged_output=true
x4.menu.bootloader.urboot.bootloader.str=-Uurboot:1s_pr_noled_{bootloader.pins}_{bootloader.baudrate}baud_{bootloader.osc}{bootloader.clock}
x4.menu.bootloader.urboot.bootloader.extended_fuses=0xfe

x4.menu.bootloader.urboot_-125=Urboot (F_CPU -1.25%)
x4.menu.bootloader.urboot_-125.upload.protocol=urclock -D -xnometadata
x4.menu.bootloader.urboot_-125.build.export_merged_output=true
x4.menu.bootloader.urboot_-125.bootloader.str=-Uurboot:1s_pr_noled_{bootloader.pins}_{bootloader.baudrate}baud_h{bootloader.clock}
x4.menu.bootloader.urboot_-125.bootloader.extended_fuses=0xfe

x4.menu.bootloader.urboot_-250=Urboot (F_CPU -2.50%)
x4.menu.bootloader.urboot_-250.upload.protocol=urclock -D -xnometadata
x4.menu.bootloader.urboot_-250.build.export_merged_output=true
x4.menu.bootloader.urboot_-250.bootloader.str=-Uurboot:1s_pr_noled_{bootloader.pins}_{bootloader.baudrate}baud_g{bootloader.clock}
x4.menu.bootloader.urboot_-250.bootloader.extended_fuses=0xfe

x4.menu.bootloader.urboot_-375=Urboot (F_CPU -3.75%)
x4.menu.bootloader.urboot_-375.upload.protocol=urclock -D -xnometadata
x4.menu.bootloader.urboot_-375.build.export_merged_output=true
x4.menu.bootloader.urboot_-375.bootloader.str=-Uurboot:1s_pr_noled_{bootloader.pins}_{bootloader.baudrate}baud_f{bootloader.clock}
x4.menu.bootloader.urboot_-375.bootloader.extended_fuses=0xfe

x4.menu.bootloader.urboot_-500=Urboot (F_CPU -5.00%)
x4.menu.bootloader.urboot_-500.upload.protocol=urclock -D -xnometadata
x4.menu.bootloader.urboot_-500.build.export_merged_output=true
x4.menu.bootloader.urboot_-500.bootloader.str=-Uurboot:1s_pr_noled_{bootloader.pins}_{bootloader.baudrate}baud_e{bootloader.clock}
x4.menu.bootloader.urboot_-500.bootloader.extended_fuses=0xfe

x4.menu.bootloader.urboot_+125=Urboot (F_CPU +1.25%)
x4.menu.bootloader.urboot_+125.upload.protocol=urclock -D -xnometadata
x4.menu.bootloader.urboot_+125.build.export_merged_output=true
x4.menu.bootloader.urboot_+125.bootloader.str=-Uurboot:1s_pr_noled_{bootloader.pins}_{bootloader.baudrate}baud_j{bootloader.clock}
x4.menu.bootloader.urboot_+125.bootloader.extended_fuses=0xfe

x4.menu.bootloader.urboot_+250=Urboot (F_CPU +2.50%)
x4.menu.bootloader.urboot_+250.upload.protocol=urclock -D -xnometadata
x4.menu.bootloader.urboot_+250.build.export_merged_output=true
x4.menu.bootloader.urboot_+250.bootloader.str=-Uurboot:1s_pr_noled_{bootloader.pins}_{bootloader.baudrate}baud_k{bootloader.clock}
x4.menu.bootloader.urboot_+250.bootloader.extended_fuses=0xfe

x4.menu.bootloader.urboot_+375=Urboot (F_CPU +3.75%)
x4.menu.bootloader.urboot_+375.upload.protocol=urclock -D -xnometadata
x4.menu.bootloader.urboot_+375.build.export_merged_output=true
x4.menu.bootloader.urboot_+375.bootloader.str=-Uurboot:1s_pr_noled_{bootloader.pins}_{bootloader.baudrate}baud_l{bootloader.clock}
x4.menu.bootloader.urboot_+375.bootloader.extended_fuses=0xfe

x4.menu.bootloader.urboot_+500=Urboot (F_CPU +5.00%)
x4.menu.bootloader.urboot_+500.upload.protocol=urclock -D -xnometadata
x4.menu.bootloader.urboot_+500.build.export_merged_output=true
x4.menu.bootloader.urboot_+500.bootloader.str=-Uurboot:1s_pr_noled_{bootloader.pins}_{bootloader.baudrate}baud_m{bootloader.clock}
x4.menu.bootloader.urboot_+500.bootloader.extended_fuses=0xfe

# EEPROM
x4.menu.eeprom.keep=EEPROM retained
x4.menu.eeprom.keep.bootloader.eesave_bit=0
x4.menu.eeprom.erase=EEPROM not retained
x4.menu.eeprom.erase.bootloader.eesave_bit=1

# Chip variants
x4.menu.chip.84=ATtiny84
x4.menu.chip.84.build.mcu=attiny84
x4.menu.chip.84.upload.maximum_size=8192
x4.menu.chip.84.upload.maximum_data_size=512

x4.menu.chip.44=ATtiny44
x4.menu.chip.44.build.mcu=attiny44
x4.menu.chip.44.upload.maximum_size=4096
x4.menu.chip.44.upload.maximum_data_size=256

x4.menu.chip.24=ATtiny24
x4.menu.chip.24.build.mcu=attiny24
x4.menu.chip.24.upload.maximum_size=2048
x4.menu.chip.24.upload.maximum_data_size=128

# Software serial
x4.menu.serial.rxtx=RX and TX
x4.menu.serial.rxtx.build.serialrxtx=
x4.menu.serial.tx=TX only
x4.menu.serial.tx.build.serialrxtx=-DTX_ONLY

# Brown out detection
x4.menu.bod.2v7=BOD 2.7V
x4.menu.bod.2v7.bootloader.bod_bits=101
x4.menu.bod.4v3=BOD 4.3V
x4.menu.bod.4v3.bootloader.bod_bits=100
x4.menu.bod.1v8=BOD 1.8V
x4.menu.bod.1v8.bootloader.bod_bits=110
x4.menu.bod.disable=BOD disabled
x4.menu.bod.disable.bootloader.bod_bits=111

# Clock frequencies
x4.menu.clock.8MHz_internal=8 MHz internal osc.
x4.menu.clock.8MHz_internal.bootloader.clock=8MHz
x4.menu.clock.8MHz_internal.bootloader.osc=i
x4.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
x4.menu.clock.8MHz_internal.bootloader.baudrate=38400
x4.menu.clock.8MHz_internal.build.clocksource=0
x4.menu.clock.8MHz_internal.build.f_cpu=8000000L

x4.menu.clock.4MHz_internal=4 MHz internal osc.
x4.menu.clock.4MHz_internal.bootloader.clock=4MHz
x4.menu.clock.4MHz_internal.bootloader.osc=i
x4.menu.clock.4MHz_internal.bootloader.low_fuses=0x62
x4.menu.clock.4MHz_internal.bootloader.baudrate=9600
x4.menu.clock.4MHz_internal.build.clocksource=0
x4.menu.clock.4MHz_internal.build.f_cpu=4000000L

x4.menu.clock.1MHz_internal=1 MHz internal osc.
x4.menu.clock.1MHz_internal.bootloader.clock=1MHz
x4.menu.clock.1MHz_internal.bootloader.osc=i
x4.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
x4.menu.clock.1MHz_internal.bootloader.baudrate=9600
x4.menu.clock.1MHz_internal.build.clocksource=0
x4.menu.clock.1MHz_internal.build.f_cpu=1000000L

x4.menu.clock.128kHz_internal=128 kHz internal osc.
x4.menu.clock.128kHz_internal.bootloader.clock=128kHz
x4.menu.clock.128kHz_internal.bootloader.osc=i
x4.menu.clock.128kHz_internal.bootloader.low_fuses=0xe4
x4.menu.clock.128kHz_internal.bootloader.baudrate=1200
x4.menu.clock.128kHz_internal.build.clocksource=3
x4.menu.clock.128kHz_internal.build.f_cpu=128000L

