felias-fogg/TinyCore/avr/boards.txt
x7.menu.chip.87=ATtiny87
x7.menu.chip.87.build.mcu=attiny87
x7.menu.chip.87.upload.maximum_size=8192
x7.menu.chip.87.upload.maximum_data_size=512

# Hardware serial
x7.menu.serial.rxtx=RX and TX
x7.menu.serial.rxtx.build.serialrxtx=
x7.menu.serial.tx=TX only
x7.menu.serial.tx.build.serialrxtx=-DTX_ONLY

# Brown out detection
x7.menu.bod.2v7=BOD 2.7V
x7.menu.bod.2v7.bootloader.bod_bits=101
x7.menu.bod.4v3=BOD 4.3V
x7.menu.bod.4v3.bootloader.bod_bits=100
x7.menu.bod.1v8=BOD 1.8V
x7.menu.bod.1v8.bootloader.bod_bits=110
x7.menu.bod.disable=BOD disabled
x7.menu.bod.disable.bootloader.bod_bits=111

# Clock frequencies
x7.menu.clock.8MHz_internal=8 MHz internal osc.
x7.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
x7.menu.clock.8MHz_internal.bootloader.baudrate=38400
x7.menu.clock.8MHz_internal.build.clocksource=0
x7.menu.clock.8MHz_internal.build.f_cpu=8000000L

x7.menu.clock.4MHz_internal=4 MHz internal osc.
x7.menu.clock.4MHz_internal.bootloader.low_fuses=0x62
x7.menu.clock.4MHz_internal.bootloader.baudrate=9600
x7.menu.clock.4MHz_internal.build.clocksource=0
x7.menu.clock.4MHz_internal.build.f_cpu=4000000L

x7.menu.clock.1MHz_internal=1 MHz internal osc.
x7.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
x7.menu.clock.1MHz_internal.bootloader.baudrate=9600
x7.menu.clock.1MHz_internal.build.clocksource=0
x7.menu.clock.1MHz_internal.build.f_cpu=1000000L

x7.menu.clock.128kHz_internal=128 kHz internal osc.
x7.menu.clock.128kHz_internal.bootloader.low_fuses=0xe3
x7.menu.clock.128kHz_internal.bootloader.baudrate=1200
x7.menu.clock.128kHz_internal.build.clocksource=3
x7.menu.clock.128kHz_internal.build.f_cpu=128000L

x7.menu.clock.20MHz_external=20 MHz external osc.
x7.menu.clock.20MHz_external.bootloader.low_fuses=0xff
x7.menu.clock.20MHz_external.bootloader.baudrate=115200
x7.menu.clock.20MHz_external.build.clocksource=1
x7.menu.clock.20MHz_external.build.f_cpu=20000000L

x7.menu.clock.18_432MHz_external=18.432 MHz external osc.
x7.menu.clock.18_432MHz_external.bootloader.low_fuses=0xff
x7.menu.clock.18_432MHz_external.bootloader.baudrate=115200
x7.menu.clock.18_432MHz_external.build.clocksource=1
x7.menu.clock.18_432MHz_external.build.f_cpu=18432000L

x7.menu.clock.16MHz_external=16 MHz external osc.
x7.menu.clock.16MHz_external.bootloader.low_fuses=0xff
x7.menu.clock.16MHz_external.bootloader.baudrate=115200
x7.menu.clock.16MHz_external.build.clocksource=1
x7.menu.clock.16MHz_external.build.f_cpu=16000000L

x7.menu.clock.14_7456MHz_external=14.7456 MHz external osc.
x7.menu.clock.14_7456MHz_external.bootloader.low_fuses=0xff
x7.menu.clock.14_7456MHz_external.bootloader.baudrate=115200
x7.menu.clock.14_7456MHz_external.build.clocksource=1
x7.menu.clock.14_7456MHz_external.build.f_cpu=14745600L

x7.menu.clock.12MHz_external=12 MHz external osc.
x7.menu.clock.12MHz_external.bootloader.low_fuses=0xff
x7.menu.clock.12MHz_external.bootloader.baudrate=57600
x7.menu.clock.12MHz_external.build.clocksource=1
x7.menu.clock.12MHz_external.build.f_cpu=12000000L

x7.menu.clock.11_0592MHz_external=11.7456 MHz external osc.
x7.menu.clock.11_0592MHz_external.bootloader.low_fuses=0xff
x7.menu.clock.11_0592MHz_external.bootloader.baudrate=115200
x7.menu.clock.11_0592MHz_external.build.clocksource=1
x7.menu.clock.11_0592MHz_external.build.f_cpu=11059200L

x7.menu.clock.9_216MHz_external=9.216 MHz external osc.
x7.menu.clock.9_216MHz_external.bootloader.low_fuses=0xff
x7.menu.clock.9_216MHz_external.bootloader.baudrate=115200
x7.menu.clock.9_216MHz_external.build.clocksource=1
x7.menu.clock.9_216MHz_external.build.f_cpu=9216000L

x7.menu.clock.8MHz_external=8 MHz external osc.
x7.menu.clock.8MHz_external.bootloader.low_fuses=0xff
x7.menu.clock.8MHz_external.bootloader.baudrate=38400
x7.menu.clock.8MHz_external.build.clocksource=1
x7.menu.clock.8MHz_external.build.f_cpu=8000000L

x7.menu.clock.7_3728MHz_external=7.3728 MHz external osc.
x7.menu.clock.7_3728MHz_external.bootloader.low_fuses=0xfd
x7.menu.clock.7_3728MHz_external.bootloader.baudrate=115200
x7.menu.clock.7_3728MHz_external.build.clocksource=1
x7.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

x7.menu.clock.6MHz_external=6 MHz external osc.
x7.menu.clock.6MHz_external.bootloader.low_fuses=0xfd
x7.menu.clock.6MHz_external.bootloader.baudrate=57600
x7.menu.clock.6MHz_external.build.clocksource=1
x7.menu.clock.6MHz_external.build.f_cpu=6000000L

x7.menu.clock.4MHz_external=4 MHz external osc.
x7.menu.clock.4MHz_external.bootloader.low_fuses=0xfd
x7.menu.clock.4MHz_external.bootloader.baudrate=9600
x7.menu.clock.4MHz_external.build.clocksource=1
x7.menu.clock.4MHz_external.build.f_cpu=4000000L

x7.menu.clock.3_6864MHz_external=3.6864 MHz external osc.
x7.menu.clock.3_6864MHz_external.bootloader.low_fuses=0xfd
x7.menu.clock.3_6864MHz_external.bootloader.baudrate=115200
x7.menu.clock.3_6864MHz_external.build.clocksource=1
x7.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

x7.menu.clock.1MHz_external=1 MHz external osc.
x7.menu.clock.1MHz_external.bootloader.low_fuses=0xfd
x7.menu.clock.1MHz_external.bootloader.baudrate=9600
x7.menu.clock.1MHz_external.build.clocksource=1
x7.menu.clock.1MHz_external.build.f_cpu=1000000L


#####################
#### ATtiny48/88 ####
#####################

# General
x8.name=ATtiny48/88
x8.upload.tool=avrdude
x8.upload.speed={bootloader.baudrate}
x8.bootloader.tool=avrdude
x8.bootloader.unlock_bits=0xff
x8.bootloader.lock_bits=0xff
x8.bootloader.high_fuses=0b1101{bootloader.eesave_bit}{bootloader.bod_bits}
x8.bootloader.pins=swio_rxd7_txd6
x8.build.core=TinyCore
x8.build.board=AVR_ATTINYX8
x8.build.extra_flags={build.serialrxtx}

# Pinout
x8.menu.pinout.standard=Standard
x8.menu.pinout.standard.build.variant=tinyx8
x8.menu.pinout.mhtiny=MH-Tiny
x8.menu.pinout.mhtiny.build.variant=tinyx8_mh

# EEPROM
x8.menu.eeprom.keep=EEPROM retained
x8.menu.eeprom.keep.bootloader.eesave_bit=0
x8.menu.eeprom.erase=EEPROM not retained
x8.menu.eeprom.erase.bootloader.eesave_bit=1

# Chip variants
x8.menu.chip.88=ATtiny88
x8.menu.chip.88.build.mcu=attiny88
x8.menu.chip.88.upload.maximum_size=8192
x8.menu.chip.88.upload.maximum_data_size=512

x8.menu.chip.48=ATtiny48
x8.menu.chip.48.build.mcu=attiny48
x8.menu.chip.48.upload.maximum_size=4096
x8.menu.chip.48.upload.maximum_data_size=256

# Software serial
x8.menu.serial.rxtx=RX and TX
x8.menu.serial.rxtx.build.serialrxtx=
x8.menu.serial.tx=TX only
x8.menu.serial.tx.build.serialrxtx=-DTX_ONLY

# Brown out detection
x8.menu.bod.2v7=BOD 2.7V
x8.menu.bod.2v7.bootloader.bod_bits=101
x8.menu.bod.4v3=BOD 4.3V
x8.menu.bod.4v3.bootloader.bod_bits=100
x8.menu.bod.1v8=BOD 1.8V
x8.menu.bod.1v8.bootloader.bod_bits=110
x8.menu.bod.disable=BOD disabled
x8.menu.bod.disable.bootloader.bod_bits=111

