felias-fogg/TinyCore/avr/boards.txt
# Clock frequencies
x8.menu.clock.8MHz_internal=8 MHz internal osc.
x8.menu.clock.8MHz_internal.bootloader.clock=8MHz
x8.menu.clock.8MHz_internal.bootloader.osc=i
x8.menu.clock.8MHz_internal.bootloader.low_fuses=0xee
x8.menu.clock.8MHz_internal.bootloader.baudrate=38400
x8.menu.clock.8MHz_internal.build.clocksource=0
x8.menu.clock.8MHz_internal.build.f_cpu=8000000L

x8.menu.clock.4MHz_internal=4 MHz internal osc.
x8.menu.clock.4MHz_internal.bootloader.clock=4MHz
x8.menu.clock.4MHz_internal.bootloader.osc=i
x8.menu.clock.4MHz_internal.bootloader.low_fuses=0x6e
x8.menu.clock.4MHz_internal.bootloader.baudrate=9600
x8.menu.clock.4MHz_internal.build.clocksource=0
x8.menu.clock.4MHz_internal.build.f_cpu=4000000L

x8.menu.clock.1MHz_internal=1 MHz internal osc.
x8.menu.clock.1MHz_internal.bootloader.clock=1MHz
x8.menu.clock.1MHz_internal.bootloader.osc=i
x8.menu.clock.1MHz_internal.bootloader.low_fuses=0x6e
x8.menu.clock.1MHz_internal.bootloader.baudrate=9600
x8.menu.clock.1MHz_internal.build.clocksource=0
x8.menu.clock.1MHz_internal.build.f_cpu=1000000L

x8.menu.clock.128kHz_internal=128 kHz internal osc.
x8.menu.clock.128kHz_internal.bootloader.clock=128kHz
x8.menu.clock.128kHz_internal.bootloader.osc=i
x8.menu.clock.128kHz_internal.bootloader.low_fuses=0xef
x8.menu.clock.128kHz_internal.bootloader.baudrate=1200
x8.menu.clock.128kHz_internal.build.clocksource=3
x8.menu.clock.128kHz_internal.build.f_cpu=128000L

x8.menu.clock.16MHz_external=16 MHz external CLOCK (overclock)
x8.menu.clock.16MHz_external.bootloader.clock=16MHz
x8.menu.clock.16MHz_external.bootloader.osc=x
x8.menu.clock.16MHz_external.bootloader.low_fuses=0xec
x8.menu.clock.16MHz_external.bootloader.baudrate=115200
x8.menu.clock.16MHz_external.build.clocksource=2
x8.menu.clock.16MHz_external.build.f_cpu=16000000L

x8.menu.clock.12MHz_external=12 MHz external CLOCK
x8.menu.clock.12MHz_external.bootloader.clock=12MHz
x8.menu.clock.12MHz_external.bootloader.osc=x
x8.menu.clock.12MHz_external.bootloader.low_fuses=0xec
x8.menu.clock.12MHz_external.bootloader.baudrate=115200
x8.menu.clock.12MHz_external.build.clocksource=2
x8.menu.clock.12MHz_external.build.f_cpu=12000000L

x8.menu.clock.8MHz_external=8 MHz external CLOCK
x8.menu.clock.8MHz_external.bootloader.clock=8MHz
x8.menu.clock.8MHz_external.bootloader.osc=x
x8.menu.clock.8MHz_external.bootloader.low_fuses=0xec
x8.menu.clock.8MHz_external.bootloader.baudrate=38400
x8.menu.clock.8MHz_external.build.clocksource=2
x8.menu.clock.8MHz_external.build.f_cpu=8000000L

# Upload port select / Bootloader
x8.menu.bootloader.no_bootloader=No bootloader
x8.menu.bootloader.no_bootloader.build.export_merged_output=false
x8.menu.bootloader.no_bootloader.bootloader.str=
x8.menu.bootloader.no_bootloader.bootloader.extended_fuses=0xff

x8.menu.bootloader.urboot=Urboot (F_CPU)
x8.menu.bootloader.urboot.upload.protocol=urclock -D -xnometadata
x8.menu.bootloader.urboot.build.export_merged_output=true
x8.menu.bootloader.urboot.bootloader.str=-Uurboot:1s_pr_noled_{bootloader.pins}_{bootloader.baudrate}baud_{bootloader.osc}{bootloader.clock}
x8.menu.bootloader.urboot.bootloader.extended_fuses=0xfe

x8.menu.bootloader.urboot_-125=Urboot (F_CPU -1.25%)
x8.menu.bootloader.urboot_-125.upload.protocol=urclock -D -xnometadata
x8.menu.bootloader.urboot_-125.build.export_merged_output=true
x8.menu.bootloader.urboot_-125.bootloader.str=-Uurboot:1s_pr_noled_{bootloader.pins}_{bootloader.baudrate}baud_h{bootloader.clock}
x8.menu.bootloader.urboot_-125.bootloader.extended_fuses=0xfe

x8.menu.bootloader.urboot_-250=Urboot (F_CPU -2.50%)
x8.menu.bootloader.urboot_-250.upload.protocol=urclock -D -xnometadata
x8.menu.bootloader.urboot_-250.build.export_merged_output=true
x8.menu.bootloader.urboot_-250.bootloader.str=-Uurboot:1s_pr_noled_{bootloader.pins}_{bootloader.baudrate}baud_g{bootloader.clock}
x8.menu.bootloader.urboot_-250.bootloader.extended_fuses=0xfe

x8.menu.bootloader.urboot_-375=Urboot (F_CPU -3.75%)
x8.menu.bootloader.urboot_-375.upload.protocol=urclock -D -xnometadata
x8.menu.bootloader.urboot_-375.build.export_merged_output=true
x8.menu.bootloader.urboot_-375.bootloader.str=-Uurboot:1s_pr_noled_{bootloader.pins}_{bootloader.baudrate}baud_f{bootloader.clock}
x8.menu.bootloader.urboot_-375.bootloader.extended_fuses=0xfe

x8.menu.bootloader.urboot_-500=Urboot (F_CPU -5.00%)
x8.menu.bootloader.urboot_-500.upload.protocol=urclock -D -xnometadata
x8.menu.bootloader.urboot_-500.build.export_merged_output=true
x8.menu.bootloader.urboot_-500.bootloader.str=-Uurboot:1s_pr_noled_{bootloader.pins}_{bootloader.baudrate}baud_e{bootloader.clock}
x8.menu.bootloader.urboot_-500.bootloader.extended_fuses=0xfe

x8.menu.bootloader.urboot_+125=Urboot (F_CPU +1.25%)
x8.menu.bootloader.urboot_+125.upload.protocol=urclock -D -xnometadata
x8.menu.bootloader.urboot_+125.build.export_merged_output=true
x8.menu.bootloader.urboot_+125.bootloader.str=-Uurboot:1s_pr_noled_{bootloader.pins}_{bootloader.baudrate}baud_j{bootloader.clock}
x8.menu.bootloader.urboot_+125.bootloader.extended_fuses=0xfe

x8.menu.bootloader.urboot_+250=Urboot (F_CPU +2.50%)
x8.menu.bootloader.urboot_+250.upload.protocol=urclock -D -xnometadata
x8.menu.bootloader.urboot_+250.build.export_merged_output=true
x8.menu.bootloader.urboot_+250.bootloader.str=-Uurboot:1s_pr_noled_{bootloader.pins}_{bootloader.baudrate}baud_k{bootloader.clock}
x8.menu.bootloader.urboot_+250.bootloader.extended_fuses=0xfe

x8.menu.bootloader.urboot_+375=Urboot (F_CPU +3.75%)
x8.menu.bootloader.urboot_+375.upload.protocol=urclock -D -xnometadata
x8.menu.bootloader.urboot_+375.build.export_merged_output=true
x8.menu.bootloader.urboot_+375.bootloader.str=-Uurboot:1s_pr_noled_{bootloader.pins}_{bootloader.baudrate}baud_l{bootloader.clock}
x8.menu.bootloader.urboot_+375.bootloader.extended_fuses=0xfe

x8.menu.bootloader.urboot_+500=Urboot (F_CPU +5.00%)
x8.menu.bootloader.urboot_+500.upload.protocol=urclock -D -xnometadata
x8.menu.bootloader.urboot_+500.build.export_merged_output=true
x8.menu.bootloader.urboot_+500.bootloader.str=-Uurboot:1s_pr_noled_{bootloader.pins}_{bootloader.baudrate}baud_m{bootloader.clock}
x8.menu.bootloader.urboot_+500.bootloader.extended_fuses=0xfe

x8.menu.bootloader.micronucleus_original=Original Micronucleus (16 MHz ext. CLOCK)
x8.menu.bootloader.micronucleus_original.upload.tool=avrdude_micronucleus
x8.menu.bootloader.micronucleus_original.upload.protocol=micronucleus -V -xwait=60
x8.menu.bootloader.micronucleus_original.build.export_merged_output=true
x8.menu.bootloader.micronucleus_original.bootloader.str=-Uflash,lfuse,efuse:w:{runtime.platform.path}/bootloaders/micronucleus/original_{build.mcu}_micronucleus_16MHz.hex:I
x8.menu.bootloader.micronucleus_original.bootloader.extended_fuses=0xfe
x8.menu.bootloader.micronucleus_original.build.clocksource=6
x8.menu.bootloader.micronucleus_original.build.f_cpu=16000000L

x8.menu.bootloader.micronucleus=New Micronucleus (16 MHz ext. CLOCK)
x8.menu.bootloader.micronucleus.upload.tool=avrdude_micronucleus
x8.menu.bootloader.micronucleus.upload.protocol=micronucleus -V -xwait=60
x8.menu.bootloader.micronucleus.build.export_merged_output=true
x8.menu.bootloader.micronucleus.bootloader.str=-Uflash,lfuse,efuse:w:{runtime.platform.path}/bootloaders/micronucleus/{build.mcu}_micronucleus_16MHz.hex:I
x8.menu.bootloader.micronucleus.bootloader.extended_fuses=0xfe
x8.menu.bootloader.micronucleus.build.clocksource=6
x8.menu.bootloader.micronucleus.build.f_cpu=16000000L

x8.menu.bootloader.micronucleus_upgrade=Upgrade to newest Micronucleus (16 MHz ext. CLOCK)
x8.menu.bootloader.micronucleus_upgrade.upload.tool=avrdude_micronucleus
x8.menu.bootloader.micronucleus_upgrade.upload.protocol=micronucleus -V -xwait=60
x8.menu.bootloader.micronucleus_upgrade.bootloader.tool=avrdude_micronucleus
x8.menu.bootloader.micronucleus_upgrade.bootloader.protocol={upload.protocol}
x8.menu.bootloader.micronucleus_upgrade.build.export_merged_output=true
x8.menu.bootloader.micronucleus_upgrade.bootloader.str=-Uflash:w:{runtime.platform.path}/bootloaders/micronucleus/upgrade_{build.mcu}_micronucleus_16MHz.hex:i
x8.menu.bootloader.micronucleus_upgrade.upload.str=-Uflash:w:{runtime.platform.path}/bootloaders/micronucleus/upgrade_{build.mcu}_micronucleus_16MHz.hex:i
x8.menu.bootloader.micronucleus_upgrade.build.clocksource=6
x8.menu.bootloader.micronucleus_upgrade.build.f_cpu=16000000L


