felias-fogg/TinyCore/avr/boards.txt
x41.menu.clock.9_216MHz_external=9.216 MHz external osc.
x41.menu.clock.9_216MHz_external.bootloader.low_fuses=0xee
x41.menu.clock.9_216MHz_external.bootloader.baudrate=115200
x41.menu.clock.9_216MHz_external.build.clocksource=1
x41.menu.clock.9_216MHz_external.build.speedfix=
x41.menu.clock.9_216MHz_external.build.f_cpu=9216000L

x41.menu.clock.8MHz_external=8 MHz external osc.
x41.menu.clock.8MHz_external.bootloader.low_fuses=0xee
x41.menu.clock.8MHz_external.bootloader.baudrate=38400
x41.menu.clock.8MHz_external.build.clocksource=1
x41.menu.clock.8MHz_external.build.speedfix=
x41.menu.clock.8MHz_external.build.f_cpu=8000000L

x41.menu.clock.7_3728MHz_external=7.3728 MHz external osc.
x41.menu.clock.7_3728MHz_external.bootloader.low_fuses=0xed
x41.menu.clock.7_3728MHz_external.bootloader.baudrate=115200
x41.menu.clock.7_3728MHz_external.build.clocksource=1
x41.menu.clock.7_3728MHz_external.build.speedfix=
x41.menu.clock.7_3728MHz_external.build.f_cpu=7372800L

x41.menu.clock.6MHz_external=6 MHz external osc.
x41.menu.clock.6MHz_external.bootloader.low_fuses=0xed
x41.menu.clock.6MHz_external.bootloader.baudrate=57600
x41.menu.clock.6MHz_external.build.clocksource=1
x41.menu.clock.6MHz_external.build.speedfix=
x41.menu.clock.6MHz_external.build.f_cpu=6000000L

x41.menu.clock.4MHz_external=4 MHz external osc.
x41.menu.clock.4MHz_external.bootloader.low_fuses=0xed
x41.menu.clock.4MHz_external.bootloader.baudrate=9600
x41.menu.clock.4MHz_external.build.clocksource=1
x41.menu.clock.4MHz_external.build.speedfix=
x41.menu.clock.4MHz_external.build.f_cpu=4000000L

x41.menu.clock.3_6864MHz_external=3.6864 MHz external osc.
x41.menu.clock.3_6864MHz_external.bootloader.low_fuses=0xed
x41.menu.clock.3_6864MHz_external.bootloader.baudrate=115200
x41.menu.clock.3_6864MHz_external.build.clocksource=1
x41.menu.clock.3_6864MHz_external.build.speedfix=
x41.menu.clock.3_6864MHz_external.build.f_cpu=3686400L

x41.menu.clock.1MHz_external=1 MHz external osc.
x41.menu.clock.1MHz_external.bootloader.low_fuses=0xed
x41.menu.clock.1MHz_external.bootloader.baudrate=9600
x41.menu.clock.1MHz_external.build.clocksource=1
x41.menu.clock.1MHz_external.build.speedfix=
x41.menu.clock.1MHz_external.build.f_cpu=1000000L

# Wire mode
x41.menu.wiremode.amaster=Master Only
x41.menu.wiremode.amaster.build.wiremode=-DWIRE_MASTER_ONLY
x41.menu.wiremode.slave=Slave Only
x41.menu.wiremode.slave.build.wiremode=-DWIRE_SLAVE_ONLY
x41.menu.wiremode.both=Master and slave
x41.menu.wiremode.both.build.wiremode=-DWIRE_BOTH


###########################
#### ATtiny261/461/861 ####
###########################

# General
x61.name=ATtiny261/461/861
x61.upload.tool=avrdude
x61.upload.speed={bootloader.baudrate}
x61.bootloader.tool=avrdude
x61.bootloader.unlock_bits=0xff
x61.bootloader.lock_bits=0xff
x61.bootloader.high_fuses=0b1101{bootloader.eesave_bit}{bootloader.bod_bits}
x61.bootloader.pins=swio_rxa7_txa6
x61.build.core=TinyCore
x61.build.variant=tinyx61
x61.build.board=AVR_ATTINYX61
x61.build.extra_flags={build.serialrxtx}

# Upload port select / Bootloader
x61.menu.bootloader.no_bootloader=No bootloader
x61.menu.bootloader.no_bootloader.build.export_merged_output=false
x61.menu.bootloader.no_bootloader.bootloader.str=
x61.menu.bootloader.no_bootloader.bootloader.extended_fuses=0xff

x61.menu.bootloader.urboot=Urboot (F_CPU)
x61.menu.bootloader.urboot.upload.protocol=urclock -D -xnometadata
x61.menu.bootloader.urboot.build.export_merged_output=true
x61.menu.bootloader.urboot.bootloader.str=-Uurboot:1s_pr_noled_{bootloader.pins}_{bootloader.baudrate}baud_{bootloader.osc}{bootloader.clock}
x61.menu.bootloader.urboot.bootloader.extended_fuses=0xfe

x61.menu.bootloader.urboot_-125=Urboot (F_CPU -1.25%)
x61.menu.bootloader.urboot_-125.upload.protocol=urclock -D -xnometadata
x61.menu.bootloader.urboot_-125.build.export_merged_output=true
x61.menu.bootloader.urboot_-125.bootloader.str=-Uurboot:1s_pr_noled_{bootloader.pins}_{bootloader.baudrate}baud_h{bootloader.clock}
x61.menu.bootloader.urboot_-125.bootloader.extended_fuses=0xfe

x61.menu.bootloader.urboot_-250=Urboot (F_CPU -2.50%)
x61.menu.bootloader.urboot_-250.upload.protocol=urclock -D -xnometadata
x61.menu.bootloader.urboot_-250.build.export_merged_output=true
x61.menu.bootloader.urboot_-250.bootloader.str=-Uurboot:1s_pr_noled_{bootloader.pins}_{bootloader.baudrate}baud_g{bootloader.clock}
x61.menu.bootloader.urboot_-250.bootloader.extended_fuses=0xfe

x61.menu.bootloader.urboot_-375=Urboot (F_CPU -3.75%)
x61.menu.bootloader.urboot_-375.upload.protocol=urclock -D -xnometadata
x61.menu.bootloader.urboot_-375.build.export_merged_output=true
x61.menu.bootloader.urboot_-375.bootloader.str=-Uurboot:1s_pr_noled_{bootloader.pins}_{bootloader.baudrate}baud_f{bootloader.clock}
x61.menu.bootloader.urboot_-375.bootloader.extended_fuses=0xfe

x61.menu.bootloader.urboot_-500=Urboot (F_CPU -5.00%)
x61.menu.bootloader.urboot_-500.upload.protocol=urclock -D -xnometadata
x61.menu.bootloader.urboot_-500.build.export_merged_output=true
x61.menu.bootloader.urboot_-500.bootloader.str=-Uurboot:1s_pr_noled_{bootloader.pins}_{bootloader.baudrate}baud_e{bootloader.clock}
x61.menu.bootloader.urboot_-500.bootloader.extended_fuses=0xfe

x61.menu.bootloader.urboot_+125=Urboot (F_CPU +1.25%)
x61.menu.bootloader.urboot_+125.upload.protocol=urclock -D -xnometadata
x61.menu.bootloader.urboot_+125.build.export_merged_output=true
x61.menu.bootloader.urboot_+125.bootloader.str=-Uurboot:1s_pr_noled_{bootloader.pins}_{bootloader.baudrate}baud_j{bootloader.clock}
x61.menu.bootloader.urboot_+125.bootloader.extended_fuses=0xfe

x61.menu.bootloader.urboot_+250=Urboot (F_CPU +2.50%)
x61.menu.bootloader.urboot_+250.upload.protocol=urclock -D -xnometadata
x61.menu.bootloader.urboot_+250.build.export_merged_output=true
x61.menu.bootloader.urboot_+250.bootloader.str=-Uurboot:1s_pr_noled_{bootloader.pins}_{bootloader.baudrate}baud_k{bootloader.clock}
x61.menu.bootloader.urboot_+250.bootloader.extended_fuses=0xfe

x61.menu.bootloader.urboot_+375=Urboot (F_CPU +3.75%)
x61.menu.bootloader.urboot_+375.upload.protocol=urclock -D -xnometadata
x61.menu.bootloader.urboot_+375.build.export_merged_output=true
x61.menu.bootloader.urboot_+375.bootloader.str=-Uurboot:1s_pr_noled_{bootloader.pins}_{bootloader.baudrate}baud_l{bootloader.clock}
x61.menu.bootloader.urboot_+375.bootloader.extended_fuses=0xfe

x61.menu.bootloader.urboot_+500=Urboot (F_CPU +5.00%)
x61.menu.bootloader.urboot_+500.upload.protocol=urclock -D -xnometadata
x61.menu.bootloader.urboot_+500.build.export_merged_output=true
x61.menu.bootloader.urboot_+500.bootloader.str=-Uurboot:1s_pr_noled_{bootloader.pins}_{bootloader.baudrate}baud_m{bootloader.clock}
x61.menu.bootloader.urboot_+500.bootloader.extended_fuses=0xfe

# EEPROM
x61.menu.eeprom.keep=EEPROM retained
x61.menu.eeprom.keep.bootloader.eesave_bit=0
x61.menu.eeprom.erase=EEPROM not retained
x61.menu.eeprom.erase.bootloader.eesave_bit=1

# Chip variants
x61.menu.chip.861=ATtiny861
x61.menu.chip.861.build.mcu=attiny861
x61.menu.chip.861.upload.maximum_size=8192
x61.menu.chip.861.upload.maximum_data_size=512

x61.menu.chip.461=ATtiny461
x61.menu.chip.461.build.mcu=attiny461
x61.menu.chip.461.upload.maximum_size=4096
x61.menu.chip.461.upload.maximum_data_size=256

